app/controllers/admin/apologies_controller.rb

INSERT INTO `apologies` (`ap_type`, `created_at`, `updated_at`, `text`) VALUES(NULL, '2011-06-03 09:43:32', '2011-06-03 09:43:32', NULL)
---
  def create
    Apology.create(:text => params[:ap1], :ap_type => "place") if params[:ap1]