app/controllers/apologies_controller.rb

  def index
    @place = Apology.find_all_by_ap_type("place").choice.text
---
SELECT * FROM `apologies` WHERE (`apologies`.`ap_type` = 'place')